<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Screenflick and builds a package.</string>
	<key>Identifier</key>
	<string>com.talosfleet.autopkg.screenflick.pkg</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Screenflick</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.5</string>
	<key>ParentRecipe</key>
	<string>om.github.foigus.download.Screenflick</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>app_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%/*.app</string>
				<key>pkg_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
			</dict>
			<key>Processor</key>
			<string>AppPkgCreator</string>
		</dict>
	</array>
</dict>
</plist>